{
	"name": "CharEditLite - Recompiled - 1.0.1",
	"description": "[h1] This is not my mod [/h1]\nThis mod was done by Mechani aka Legion, https://github.com/Mechani-Legion/ and kindly put on github.\n\nNew Github is here: https://github.com/teella/chareditlite_recompiled\n\nAnd will place older versions there when an update is done.\n\nWe plan to stay true to this mod. It's a beautiful work of art!\n\nOriginal Mod Link for now:\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=1366358141\n\n[h1]Original Info[/h1]\n\nA little mod for saving, loading or editing the appearance of the characters and thralls (for solo/coop and server).\n\nPAK file and sources are available on GitHub under Apache License 2.0:\nhttps://github.com/Mechani-Legion/CharEditLite\n\n[h1]Summary & manual[/h1]\n\n[b]Features:[/b]\n[list]\n[*]Full character editor.\n[*]Customisation rights management for admin.\n[*]HD preview with free camera to look around it.\n[*]Toggle off/on the outfit of the previewed character.\n[*]Percentage display for scalar sliders and possibility to set them manually.\n[*]Management of appearances with code and shards.\n[*]Full RGB color choice for shard creation.\n[*]The thralls can be changed with shards.\n[*]Checking and auto-correction of the edited character.\n[*]RGB Lab to unlock all colors as temporary dye (can be saved).\n[*]Good compatibility with others mods. Automatic addition of some customisation features.\n[/list]\n\n[b]Complementary info:[/b]\n[list]\n[*]Mod ID: 2169663966\n[*]Version: 1.0.0 (based on 6.8.4 of original CharEditLite)\n[*]Solo/coop and server compliant.\n[*]The mod is triggered by an item named \"Mirror\". Crafted at Artisan's Worktable.\n[*]The mirror gives a code or can create an item named \"Shard\" for the management of appearances.\n[*]Admin can set the customisations available for the mirror and fragments.\n[*]Admin can use black/white list to manage players access to the mirror and shards.\n[*]The shard can be used on self for a quick change of appearance.\n[*]The shard must be placed in thralls inventory/station and then used to change them.\n[*]The shard can capture the target appearance.\n[*]The shard can edit its stored appearance when placed in the character inventory.\n[*]The shard show available customisations and can select which one to use.\n[*]In case of religion changing. If you want to update the recipes, you need to use a yellow lotus potion.\n[*]Auto-correction is based on vanilla values or extended, but they can be altered by others mods.\n[*]Scalars values can be chosen between vanilla, extended and modded.\n[*]RGB Lab and extended scalars must be unlocked by the admin or the host.\n[*]Old generated code can be invalidated by game update.\n[/list]\n\n[b]How to be Admin:[/b]\n[olist]\n[*]Esc menu in game => \"Settings\" => tab \"Server Settings\" => click \"Make Me Admin\" => Exit settings\n[*]Esc menu in game => \"Admin Panel\"\n[/olist]\n\n[b]Overview/editor panel:[/b] Contains all the modifiable informations of the character.\n[list]\n[*]Button \"Regenerate code\":\n[list]\n[*]Get the code of the in game character and displays its informations and preview.\n[*]Can be used in case of invalid code.\n[/list]\n[*]Code field: Can contain the code of the in game character or mirror character or notepad/txt character.\n[list]\n[*]The code can be copied from the field to notepad/txt, and vice versa.\n[*]Manually set code: If valid, its informations and preview are displayed.\n[*]Using editor: Checking values and update code.\n[/list]\n[*]Button \"Create shard\":\n[list]\n[*]Put a shard in the inventory with the appearance of the preview stored on it.\n[*]Shard can be created with different appearances without using the button \"Apply\" of the mirror.\n[/list]\n[/list]\n\n[b]Preview panel:[/b] Render of the in game character or the edited one.\n[list]\n[*]Mouse:\n[list]\n[*]Left click to move and rotate.\n[*]Wheel to zoom.\n[/list]\n[*]Button \"Reset\":\n[list]\n[*]Resets camera view.\n[*]In case of invalid code, get the code of the previewed character instead of the in game character.\n[/list]\n[/list]\n\n[b]Shard panel:[/b] Render of the shard or target appearance and of the final appearance according to the choices.\n[list]\n[*]Interaction: Same as the mirror.\n[*]Upper checkbox: Only for station thralls, the warpaint (exception) and outfit of the shard can be apply to them. The appearance of the shard can also be ignored in these cases.\n(exception) Warpaints appearance can be shared with everyone, but is permanent only for station thralls.\n[*]Lower checkbox: Enable or disable the customisation option if available.\n[*]Edit mod: Only available in the character inventory.\n[list]\n[*]Switch warpainnt: Change the warpaint according to the character.\n[*]Switch outfit: Change the outfit according to the character.\n[/list]\n[/list]\n\n[b]Admin panel:[/b] Show general access for all mirrors and shards. Also show player list for specific access.\n[list]\n[*]Checkbox: Enable or disable the customisation option.\n[*]Button \"Commit\": Needed to save all changes made.\n[*]List: Show the identified players.\n[list]\n[*]Buttons: Manage specific access for a selected player.\n[*]Delete all: Erase all lists and can not be cancelled, players need to relog to refresh the lists.\n[/list]\n[/list]\n\n[b]Checking & message:[/b]\n[list]\n[*]Request confirmation triggered before changing the in game character by the mirror or shard character.\n[*]In case of invalid code:\n[list]\n[*]The interface is greyed.\n[*]\"Regenerate code\" and \"Reset\" still available to reget a code.\n[/list]\n[*]In case of wrong values (mostly with gender change):\n[list]\n[*]The auto-correction changes it or them.\n[*]Notification of warning triggered.\n[/list]\n[/list]\n\n[b]Know issues:[/b]\n[list]\n[*]Buildings name don't change when players define their new name. Log out/in is requiered to refresh buildings name. Properties still belong to players even without refreshing the name.\n[*]Hair of the previewed character may be degrade to low quality. It's a temporary glitch, the code and in game character still correct when you apply modifications.\n[*]A seam may be visible on the neck of the previewed character. It's a temporary glitch, the code and in game character still correct when you apply modifications.\n[*]Some scalars can render a wrong preview. The code still correct and the in game character is modified according to it.\n[*]Some scalars are ignored by station thralls, but the fragment remains valid and can be applied correctly to characters and placeable thralls.\n[*]Some issues can occur with the order of the mods. Try placing this mod at the top or bottom of the list to fix this.\n[/list]\n\n[b]Old versions:[/b]\n[olist]\n[*]Go to https://github.com/Mechani-Legion/CharEditLite/tree/master/CharEditLite/PAK .\n[*]Download the required version pak file into \"...\\Steam\\steamapps\\common\\Conan Exiles\\ConanSandbox\\Mods\" and rename it to \"CharEditLite.pak\".\n[/olist]",
	"changeNote": "- No more disappearing green in RGB Lab",
	"author": "Teella",
	"authorUrl": "https://github.com/teella/CharEditLite",
	"versionMajor": 1,
	"versionMinor": 0,
	"versionBuild": 1,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "2169663966",
	"steamVisibility": 0,
	"folderName": "CharEditLite",
	"revisionNumber": 233751,
	"snapshotId": 25795
}